<?php
namespace Department\Controller;

use Common\Controller\AdminbaseController;
class DepartmentTreeController extends AdminbaseController{
	public function _initialize() {
        parent::_initialize();
    }
	public function getDepartment(){
		return array(
			'事业1部'=>array(
				'1'=>'事业1部业务1部(王波)',
				'3'=>'事业1部业务3部(崔君亮)',
				'25'=>'事业1部业务2部(张继贤)',
				'34'=>'事业1部业务4部(胡海宝)',
				'37'=>'事业1部业务5部(吴林高)'
				),
			'事业2部'=>array(
				'4'=>'事业2部业务1部(陈欣)',
				'6'=>'事业2部业务2部(元王毅)',
				'7'=>'事业2部业务3部(方浩帆)',
				'36'=>'事业2部业务4部(杨文君)'
				),
			'事业3部'=>array(
				'8'=>'事业3部(张德春)',
				'32'=>'事业3部1组(张奕)',
				'33'=>'事业3部2组(林株泉)'
				),
			'事业4部'=>array(
				'9'=>'事业4部1组(苏营)',
				'10'=>'事业4部2组(叶洪宇)',
				'11'=>'事业4部3组(张泽森)'
				),
			'事业6部'=>array(
				'30'=>'事业6部0组(杨金华)',
				'31'=>'事业6部1组(林聪学)',
				),
			'事业7部'=>array(
				'26'=>'事业7部0组(杨文君)',
				'13'=>'事业7部1组(郑建钦)',
				'14'=>'事业7部2组(江林)',
				'15'=>'事业7部3组(廖羽)'
				),
			'事业8部'=>array(
				'27'=>'事业8部0组(吴林高)',
				'16'=>'事业8部1组(钟柳斌)'
				),
			'事业9部'=>array(
				'17'=>'事业9部(张志平)'
				)
			);
	}
}
?>